In [1]:
# q1
# for handling missing data first we replace the missing data with NAN. 
# then we take the average from that column if its numerical value or we take the
# most used string and replace all nan with the average values using numpy library

In [2]:
#q2:
import pandas as pd
data = pd.read_csv('C:\\Users\\DELL\\Downloads\\data.csv')

In [3]:
import numpy as np
data.replace("-",np.nan, inplace=True)

In [4]:
stateAverage = data["State"].value_counts().idxmax()

In [5]:
data["State"].replace(np.nan,stateAverage,inplace=True)

In [6]:
commonGender = data["Gender"].value_counts().idxmax()

In [7]:
data["Gender"].replace(np.nan,commonGender,inplace=True)
data

    S.No      Name     State Gender  Age
0      0     Altaf    Lahore      M   63
1      1     Imran    London      M   33
2      2     Hamza    Lahore      M  NaN
3      3  Bahtawar  Peshawar      F   19
4      4   Ranveer     Dehli      M   34
5      5      Kaif    Mumbai      M   32
6      6   Deepika    Lahore      F   31
7      7    Mahira   Karachi      M   60
8      8    Waseem    Lahore      M  NaN
9      9      ASAD    csdcds      M   56
10    10      jhvh     hgghc      M   55

In [8]:
a =data["Age"].astype("float").mean()
a=round(a)
a

43

In [9]:
data["Age"].replace(np.nan,a,inplace=True)

In [10]:
data

    S.No      Name     State Gender Age
0      0     Altaf    Lahore      M  63
1      1     Imran    London      M  33
2      2     Hamza    Lahore      M  43
3      3  Bahtawar  Peshawar      F  19
4      4   Ranveer     Dehli      M  34
5      5      Kaif    Mumbai      M  32
6      6   Deepika    Lahore      F  31
7      7    Mahira   Karachi      M  60
8      8    Waseem    Lahore      M  43
9      9      ASAD    csdcds      M  56
10    10      jhvh     hgghc      M  55

In [11]:
md = data.isnull()

In [12]:
md.sum()

S.No      0
Name      0
State     0
Gender    0
Age       0
dtype: int64

In [13]:
#Q3

data['Age'] = data['Age'].astype("int")
b = np.linspace(0,max(data['Age']),4)
b=[0,30,55,max(data['Age'])]
b

[0, 30, 55, 63]

In [14]:
lbl = ['YOUNG','MIDDLE AGE','OLDER AGE']
data['Age-Binned'] = pd.cut(data['Age'],b,labels=lbl,include_lowest=True)

In [15]:
data

    S.No      Name     State Gender  Age  Age-Binned
0      0     Altaf    Lahore      M   63   OLDER AGE
1      1     Imran    London      M   33  MIDDLE AGE
2      2     Hamza    Lahore      M   43  MIDDLE AGE
3      3  Bahtawar  Peshawar      F   19       YOUNG
4      4   Ranveer     Dehli      M   34  MIDDLE AGE
5      5      Kaif    Mumbai      M   32  MIDDLE AGE
6      6   Deepika    Lahore      F   31  MIDDLE AGE
7      7    Mahira   Karachi      M   60   OLDER AGE
8      8    Waseem    Lahore      M   43  MIDDLE AGE
9      9      ASAD    csdcds      M   56   OLDER AGE
10    10      jhvh     hgghc      M   55  MIDDLE AGE